//==============================================================================
// 
// ビル[bill.h]
// Auther: KOUTAROUNISIDA
// 
//==============================================================================

//==============================================================================
// インクルードガード
//==============================================================================
#ifndef __BILL_H_
#define __BILL_H_
//==============================================================================
// インクルード
//==============================================================================
#include "sceneX.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define WALL_MAX (5)

//==============================================================================
// クラス
//==============================================================================
class CScene3D;

class CBill:public CSceneX
{
public:
	CBill(int priority = PRIORITY_MAX - 1, OBJTYPE objType = OBJTYPE_BILL);
	~CBill();
	HRESULT Init(LPDIRECT3DDEVICE9 device,D3DXVECTOR3 pos,D3DXVECTOR3 rot,CImport::XFILES xFile);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CBill *Create(LPDIRECT3DDEVICE9 device,D3DXVECTOR3 pos,D3DXVECTOR3 rot,CImport::XFILES xFile);

	bool GetDirtComplete(void);
	bool GetCleanComplete(void);
	bool Defile(void);
	bool Clean(void);
private:
	CScene3D	*m_pDirtWall[WALL_MAX];
	bool		m_bDirt;
	bool		m_bClean;

	D3DXCOLOR	m_color;
	D3DXVECTOR3 m_VtxMin;
	D3DXVECTOR3 m_VtxMax;
};

//==============================================================================
// 構造体定義
//==============================================================================

//==============================================================================
// プロトタイプ宣言
//==============================================================================
#endif
// EOF