//*****************************************************************************
//
// CDustクラス [dust.h]
// Author : YUJI MOMOI
//
//*****************************************************************************

#ifndef _DUST_H
#define _DUST_H
//=============================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "main.h"
#include "sceneX.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 構造体定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// クラス定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CDust : public CSceneX
{
public:

	CDust(int priority = PRIORITY_MAX - 1, OBJTYPE objType = OBJTYPE_ENEMY);
	~CDust(){};

	static	CDust* Create(LPDIRECT3DDEVICE9 device, CImport::XFILES xFile);
	HRESULT	Init(LPDIRECT3DDEVICE9 device, CImport::XFILES xFile);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);

	void SetParent(CSceneX* parent){m_parent = parent;}

private:
};

//=============================================================================
#endif