//*****************************************************************************
//
// CDustAI処理 [dustAI.h]
// Author : Yuji Momoi
//
//*****************************************************************************

#ifndef __DUSTAI_H__
#define __DUSTAI_H__
//=============================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "main.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// マクロ定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#define THINK_COOL_TIME (60)	// 思考間隔

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 列挙体定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 構造体定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
typedef enum
{
	TACTICS_STATE_NONE = 0,
	TACTICS_STATE_ATTACK_POSSIBLE,
	TACTICS_STATE_ATTACK,
	TACTICS_STATE_ATTACK_END,
	TACTICS_STATE_MOVE_START,
	TACTICS_STATE_MOVE,
	TACTICS_STATE_STAY,
	TACTICS_STATE_MAX
}TACTICS_STATE;

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 前方宣言
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CDust;

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// クラス定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CDustAI
{
public:

	CDustAI();
	~CDustAI(){};

	static CDustAI* Create(CDust* pDust);
	HRESULT Init(CDust* pDust);
	void Uninit(void);
	void Update(void);

private:
	void SetDust(CDust* dust){m_dust = dust;}
	// 目的地を決める
	void ThinkPosDest(void);
	// 視界内サーチ
	bool SerchVision(void);
	// 攻撃準備時の処理
	void AttackPossible(void);
	// 攻撃処理
	void Attack(void);
	// 攻撃後の処理
	void AttackEnd(void);

	TACTICS_STATE TacticsState;
	int m_nThinkCount;
	CDust* m_dust;
};

//=============================================================================
#endif __DUSTAI_H__