//*****************************************************************************
//
// CSceneクラス [scene.cpp]
// Author :MAI TANABE
//
//*****************************************************************************

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "scene.h"
#include "listObject.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// マクロ定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 静的変数
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
CScene* CScene::m_top[PRIORITY_MAX];
CScene* CScene::m_cur[PRIORITY_MAX];

//=============================================================================
// コンストラクタ
//=============================================================================
CScene::CScene(int priority, OBJTYPE objType)
{
	//----------------------------
	// シーンリスト追加
	//----------------------------
	// プライオリティ設定
	m_priority = priority;

	// オブジェタイプ設定
	m_objType = objType;

	// 先頭チェック
	if(m_top[m_priority] == NULL)
	{
		m_top[m_priority] = this;
		m_prev = NULL;
	}
	else
	{
		// 前オブジェクトから連結
		m_cur[m_priority]->m_next = this;
		m_prev = m_cur[m_priority];
	}

	// 次オブジェクト初期化
	m_next = NULL;

	// 終端アドレス設定
	m_cur[m_priority] = this;

	//----------------------------
	// 削除フラグ
	//----------------------------
	m_delete = false;

	//----------------------------
	// オブジェクトリスト追加
	//----------------------------
	CListObject::LinkObj(this, m_priority);
}

//=============================================================================
// 全終了
//=============================================================================
void CScene::ReleaseAll(void)
{
	CScene* cur;
	CScene* next;

	for(int cnt = 0; cnt < PRIORITY_MAX; ++cnt)
	{
		cur = m_top[cnt];

		while(cur)
		{
			next = cur->m_next;
			cur->Uninit();

			cur->UnLinkScene();
			delete cur;

			cur  = next;
		}
	}
}

//=============================================================================
// 脱リスト
//=============================================================================
void CScene::UnLinkScene(void)
{
	//----------------------------
	// シーンリストから破棄
	//----------------------------
	if(m_prev != NULL)
	{
		m_prev->m_next = m_next;
	}
	else // Topだった場合
	{
		m_top[m_priority] = m_next;

		if(m_top[m_priority] != NULL)
		{
			m_top[m_priority]->m_prev = NULL;
		}
	}

	if(m_next != NULL)
	{
		m_next->m_prev = m_prev;
	}
	else // Curだった場合
	{
		m_cur[m_priority] = m_prev;

		if(m_top[m_priority] != NULL)
		{
			m_cur[m_priority]->m_next = NULL;
		}
	}

	//----------------------------
	// オブジェクトリストから破棄
	//----------------------------
	CListObject::UnlinkObj(this);
}
